#+BEGIN_COMMENT
.. title: Comparing Energy Prices
.. slug: comparing-energy-prices
.. date: 2022-07-12 13:13:00 UTC-07:00
.. tags: global warming,unit conversion
.. category: Global Warming
.. link: 
.. description: Using unit-conversion to compare prices for different energy sources.
.. type: text
.. has_math: True
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-07607863-5872-4ff9-8e44-c934c4f277f8-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC

#+begin_src python :results none
# from python
from fractions import Fraction

def print_energy(megajoules_per_dollar: float, source: str) -> None:
    """Print the energy provided by the source.

    Args:
     megajoules_per_dollar: how many megajoules provided by the source for each dollar
     source: where the energy is coming from
    """
    print(f"{source} provides {megajoules_per_dollar:0.2f} megajoules per dollar.")
    print(f"{source} costs ${1/megajoules_per_dollar:0.4f} per megajoule.")
    return

COSTS = []
#+end_src

** In Python
#+begin_src python :results output :exports both
gallons_per_dollar = Fraction(1, 5)
joules_per_gallon = 13 * 10**7
joules_per_dollar = joules_per_gallon * gallons_per_dollar
MEGAJOULES_PER_JOULE = Fraction(1, 10**6)
gas_megajoules_per_dollar = joules_per_dollar * megajoules_per_joule
gasoline = 1/gas_megajoules_per_dollar

print_energy(float(gas_megajoules_per_dollar), "Gasoline")
COSTS.append((gasoline, "Gasoline"))
#+end_src

#+RESULTS:
: Gasoline provides 26.00 megajoules per dollar.
: Gasoline costs $0.0385 per megajoule.

** Check The Math
#+begin_src python :results output :exports both
kilowatt_hours_per_dollar = 20 # 1/0.05 = 20
megajoules = 3.6
electricity_megajoules_per_dollar = kilowatt_hours_per_dollar * megajoules
electricity = 1/electricity_megajoules_per_dollar

print_energy(electricity_megajoules_per_dollar, "Electricity")
COSTS.append((electricity, "Electricity"))
#+end_src

#+RESULTS:
: Electricity provides 72.00 megajoules per dollar.
: Electricity costs $0.0139 per megajoule.

** Check The Math
#+begin_src python :results output :exports both
joules_per_cubic_foot = 1.1E6
cubic_feet_per_btu = 1/1030
btus_per_dollar = 5e5

joules_per_btu = joules_per_cubic_foot * cubic_feet_per_btu

joules_per_dollar = joules_per_btu * btus_per_dollar
natural_gas_megajoules_per_dollar = joules_per_dollar * MEGAJOULES_PER_JOULE
natural_gas = 1/natural_gas_megajoules_per_dollar
print_energy(natural_gas_megajoules_per_dollar, "Natural Gas")
COSTS.append((natural_gas, "Natural Gas"))
#+end_src

#+RESULTS:
: Natural Gas provides 533.98 megajoules per dollar.
: Natural Gas costs $0.0019 per megajoule.

** Checking the Math

#+begin_src python :results output :exports both
coal_megajoules_per_dollar = MEGAJOULES_PER_JOULE * 3.2e10/40
coal = 1/coal_megajoules_per_dollar
print_energy(coal_megajoules_per_dollar, "Coal")
COSTS.append((coal, "Coal"))
#+end_src

#+RESULTS:
: Coal provides 800.00 megajoules per dollar.
: Coal costs $0.0013 per megajoule.

** Checking the Math
#+begin_src python :results output :exports both
ounces_per_dollar = 1/0.10
kilocalories_per_ounce = 240
joules_per_calorie = 4.2
calories_per_kilocalorie = 10**3

corn_megajoules_per_dollar = (ounces_per_dollar
                              ,* kilocalories_per_ounce
                              ,* calories_per_kilocalorie
                              ,* joules_per_calorie
                              ,* MEGAJOULES_PER_JOULE)
corn = 1/corn_megajoules_per_dollar
print_energy(corn_megajoules_per_dollar, "Corn")
COSTS.append((corn, "Corn"))
#+end_src

#+RESULTS:
: Corn provides 10.08 megajoules per dollar.
: Corn costs $0.0992 per megajoule.

* What Is the Ratio of the Cost of the Most Expensive to the Cheapest?
#+begin_src python :results output :exports both
most_expensive, cheapest, cost, name = max(COSTS), min(COSTS), 0, 1
print(f"The most expensive form of energy is {most_expensive[name]} "
      f"at ${most_expensive[cost]:0.2f} per megajoule.")
print(f"The cheapest form of energy is {cheapest[name]} at "
      f"${cheapest[cost]:0.4f} per megajoule.")
#+end_src

#+RESULTS:
: The most expensive form of energy is Corn at $0.10 per megajoule.
: The cheapest form of energy is Coal at $0.0013 per megajoule.

#+begin_src python :results output :exports both
print(f"{most_expensive[name]} is {most_expensive[cost]/cheapest[cost]:0.2f} "
      f"times more expensive than {cheapest[name]}.")
#+end_src

#+RESULTS:
: Corn is 79.37 times more expensive than Coal.

